{
    "configuration": 
    {
        "headers": "<p><em>Le message qui suit est une réponse automatique activée par un membre de l'équipe. Les réponses automatiques leur permettent d'éviter d'avoir à répéter de nombreuses fois la même chose ce qui leur fait gagner du temps et leur permet de s'occuper des sujets qui méritent plus d'attention plus facilement.<br />Nous sommes néanmoins ouverts et si vous avez une question ou une remarque, n'hésitez pas à contacter la personne en question par Message Privé.</em><br />Pour plus d'informations, nous vous invitons à lire les <a href=\"https://openclassrooms.com/forum/sujet/regles-et-bonnes-pratiques-du-forum-9#message-84002601\">règles générales du forum</a></p>",
        "deplacer": "<h1>Mauvais forum</h1><p>Le sujet est déplacé dans le forum approprié : $$</p>",
        "fermer": "<p>Je ferme ce sujet. Me contacter par MP si besoin.</p>"
    },

    "answers" : 
    [
        {
            "id": 1,
            "section": ["Recrutements pour vos projets"],
            "exclude": ["Forum du staff"],
            "title": "Mauvais format",
            "message": "<p>Bonjour,</p><p>Afin de maintenir le forum <em>Recrutements</em> dans un état lisible, nous demandons à chaque personne initiant un nouveau sujet de respecter un certain format de message, donc certaines règles. Ces règles sont listées dans le <a href=\"https://openclassrooms.com/forum/sujet/regles-obligatoires-a-respecter-sur-ce-forum-1\">post-it de ce forum</a> et doivent impérativement être respectées. Tout sujet ne les respectant pas sera irrémédiablement fermé.</p>"
        },

        {
            "id": 2,
            "section": ["Recrutements pour vos projets"],
            "exclude": ["Forum du staff"],
            "title": "Mauvais titre",
            "message": "<p>Bonjour,</p><p>Afin de maintenir le forum <em>Recrutements</em> dans un état lisible, nous demandons à chaque personne initiant un nouveau sujet de respecter un certain format de titre. Chaque titre de sujet présent dans cette catégorie doit se composer de manière à respecter le format [Type de Projet] Nom du projet. Attention, \"Recrutement\" n'est pas un type correct, nous nous doutons que vous recrutez pour votre projet si vous postez un message ici.</p><p>Quelques exemples de titres corrects :</p><ul><li>[Application] Tinder</li> <li>[MOBA] Heroes Of The Storm</li> <li>[Site Web]OpenClassRooms</li></ul><p>Merci de votre compréhension.</p>"
        },

        {
            "id": 3,
            "section": ["Recrutements pour vos projets"],
            "exclude": ["Forum du staff"],
            "title": "Aucune avancée",
            "message": "<p>Bonjour,</p><p>Afin de préserver le forum dans un état correct et de ne garder que des projets intéressants, nous demandons à quiconque créant un sujet dans cette section de respecter quelques règles. Il est, entre autre, demandé de présenter une avancé concrète ou un véritable travail de recherche sur votre projet.</p>"
        },

        {
            "id": 4,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Manque de précisions",
            "message": "<p>Bonjour,</p><p>Vous êtes ici sur un forum d'entraide communautaire et non pas sur un forum de demande de service, le but n'est donc pas de fournir une réponse toute faite ou de directement fournir la solution à quiconque viendrait sans la moindre trace. Afin d'obtenir de l'aide et une solution à votre problème, il est fortement recommandé de présenter clairement l'état actuel du problème en nous fournissant :</p> <ul> <li>Un descriptif clair et précis du problème</li> <li>La tentative actuelle de résolution que vous avez effectué</li> <li>Le résultat attendu et le résultat actuel</li> <li>Toutes pistes de recherches pouvant aider à la résolution</li> </ul>"
        },

        {
            "id": 5,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Hello @OC",
            "message": "<p>Bonjour,</p><p>Afin de vous assurer d'avoir une réponse le plus rapidement possible, je vous invite à directement contacter l'équipe du site via l'adresse <a href=\"mailto:hello@openclassrooms.com\">hello@openclassrooms.com</a>. En effet, l'équipe du site ne passant que très rarement sur les forums, il sera beaucoup plus efficace de les contacter directement.</p>"
        },

        {
            "id": 6,
            "section": ["Présentation de vos projets"],
            "exclude": ["Forum du staff"],
            "title": "Mauvais format",
            "message": "<p>Bonjour,</p><p>Afin de maintenir le forum <em>Présentation</em> dans un état lisible, nous demandons à chaque personne initiant un nouveau sujet de respecter un certain format de message, donc certaines règles. Ces règles sont listées dans le <a href=\"https://openclassrooms.com/forum/sujet/regles-obligatoires-a-respecter-sur-ce-forum-2\">post-it de ce forum</a>et doivent impérativement être respectées.</p>"
        },

        {
            "id": 7,
            "section": ["Présentation de vos projets"],
            "exclude": ["Forum du staff"],
            "title": "Mauvais titre",
            "message": "<p>Bonjour,</p><p>Afin de maintenir le forum <em>Présentation</em> dans un état lisible, nous demandons à chaque personne initiant un nouveau sujet de respecter un certain format de titre. Chaque titre de sujet présent dans cette catégorie doit se composer de manière à respecter le format [Type de Projet] Nom du projet. Attention, \"Présentation\" n'est pas un type correct, nous nous doutons que vous présentez votre projet si vous postez un message ici.</p> <p>Quelques exemples de titres correct :</p> <ul> <li>[Application] Tinder</li> <li>[MOBA] Heroes Of The Storm</li> <li>[Site Web] OpenClassrooms</li> </ul><p>Merci de modifier votre message en conséquence via le bouton \"Modifier\" situé sur son coin supérieur droit, sans quoi le sujet sera fermé."
        },
        
        {
            "id": 9,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Manque de Politesse",
            "message": "<p>Bonjour,</p><p>Votre message ne comporte pas ou peu de formules de politesse (« Bonjour », « Merci », « Au revoir », etc.). Les règles du site exigent que chaque nouveau message comporte un minimum de politesse. Après tout, les gens qui répondent le font gratuitement, sur leur temps libre. Ils méritent bien un minimum de considération, n'est-ce pas ?</p> <p>Merci de modifier votre message en conséquence via le bouton \"Modifier\" situé sur son coin supérieur droit, sans quoi le sujet sera fermé.</p>"
        },
        
        {
            "id": 10,
            "section": ["Programmation", "Site Web"],
            "exclude": ["Forum du staff"],
            "title": "Merci d'utiliser les balises de code",
            "message": "<p>Bonjour,</p><p>Les forums d'Openclassrooms disposent d'une fonctionnalité permettant de colorer et mettre en forme les codes source afin de les rendre plus lisibles et faciles à manipuler par les intervenants. Pour celà, il faut utiliser le bouton <img src=\"https://sdz-upload.s3.amazonaws.com/prod/upload/code.gif\" alt=\"Image\" /> . Si vous utilisez l'éditeur de messages en mode Markdown, il faut utiliser les balises <code>&lt;pre class=\"brush: c;\"&gt;Votre code ici&lt;/pre&gt;</code>.</p> <p>Merci de modifier votre message en conséquence via le bouton \"Modifier\" situé sur son coin supérieur droit, sans quoi le sujet sera fermé.</p>"
        },
        
        {
            "id": 11,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Déterrage",
            "message": "<p><strong>Citation des <a title=\"Règles générales du forum\" href=\"regles-et-bonnes-pratiques-du-forum-9#message-84002601\">règles générales du forum</a> :</strong></p><blockquote><p>Avant de poster, demandez-vous si ce que vous allez dire apporte quelque chose au sujet. Si votre message n'apporte rien, vous ferez perdre du temps à tout le monde et le sujet pourrait dévier ou devenir difficile à suivre.</p><p>Aussi, vérifiez la date du topic. <strong>Le déterrage de topic nuit au bon fonctionnement du forum et est interdit.</strong> Utilisez les boutons <img src=\"https://i.imgur.com/Zv6bNgw.png\" alt=\"pouce en haut\" width=\"23\" height=\"23\" /> pour dire merci. Si le topic date de plus de deux mois sans réponses, mieux vaut ne pas répondre. Si vous avez une question similaire, créez plutôt votre propre sujet en détaillant votre contexte</p></blockquote>"
        },
        
        {
            "id": 12,
            "section": ["Graphisme 3D"],
            "exclude": ["Forum du staff"],
            "title": "Manque de recherche FAQ 3D",
            "message": "<p>Bonjour,</p><p>Il semblerait que votre question soit abordée dans la <a href=\"https://openclassrooms.com/forum/sujet/faq-blender-et-la-3d-en-general\">FAQ de la section Graphisme 3D</a>.</p><p>Vous êtes ici sur un forum d'entraide communautaire et non pas sur un forum de demande de service, le but n'est donc pas de fournir un tutoriel à la demande ou de directement fournir la solution à quiconque viendrait sans la moindre trace. Afin d'obtenir de l'aide et une solution à votre problème, il est fortement recommandé de présenter clairement l'état actuel du problème en nous fournissant : </p> <ul> <li>Un descriptif clair et précis du problème</li> <li>La tentative actuelle de résolution que vous avez effectué</li> <li>Le comportement attendu et le comportement actuel</li> <li>Toutes pistes de recherches pouvant aider à la résolution</li> </ul> <p>Je ferme ce sujet et je vous invite à en ouvrir un nouveau présentant ces différentes informations.</p>"
        },
        
        {
            "id": 13,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Manquement global aux règles",
            "message": "<p>Bonjour,</p><p>Votre message enfreint beaucoup de règles basiques du forum à tel point qu'il serait peut judicieux de les énumérer dans ce message. Je vous invite donc à lire de toute urgence les <a href=\"regles-et-bonnes-pratiques-du-forum-9#message-84002601\">règles générales du forum</a> ainsi que <a href=\"../../terms-conditions#code-of-conduct\">la Charte de Bonne Conduite</a> et les éventuelles règles additionnelles de la section du forum dans laquelle vous postez, visibles parmi les sujets épinglés lorsqu'il y en a.</p>"
        },
        
        {
            "id": 14,
            "section": ["Graphisme 3D"],
            "exclude": ["Forum du staff"],
            "title": "Le tuto Blender est dépassé",
            "message": "<p>Bonjour.</p><p>Le cours Blender d'OpenClassrooms étant vastement obsolète et même faux par endroits, je te conseille vivement de t'orienter vers cette suite de tutos qui a l'avantage d'être à jour et d'être faite par un professionnel expérimenté :</p><p><a href=\"https://www.youtube.com/playlist?list=PLuZVx6uIcP-QSUx9zyGto6ZWSABeAH_76\">Formation Blender 2.73</a></p><p>Tu trouveras également d'autres tutos sur d'autres sujets plus poussés sur la même chaîne, et ailleurs. En tout cas, méfie-toi des tutos faits sur des versions antérieures à Blender 2.60.</p>"
        },
        
        {
            "id": 15,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Pas de données personnelles",
            "message": "<p>Bonjour,</p><p>Il est dangereux de poster des données personnelles à la vue de tout le monde sur Internet, car elles pourraient être utilisées à mauvais esscient et entraîner des nuisances pour son propiétaire et ses proches.</p><p>Pour transmettre des données personnelles, préférez les messages privés.</p>"
        },
        
        {
            "id": 16,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Mise en page abusive",
            "message": "<p>Bonjour,</p><p>Les outils de mise en page servent à rendre votre message plus lisible et compréhensible, pas à faire des décorations expérimentales ou à s'amuser à faire des textes arc-en-ciel.</p><p>Merci de modifier votre message afin de réduire la mise en page au strict nécessaire.</p>"
        },

        {
            "id": 17,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Manque de recherche",
            "message": "<p>Bonjour,</p><p>La question que vous posez est très fréquente, cela démontre un manque de recherche évident. Internet et ce forum fourmillent de sujets similaires.</p><p>Je vous invite effectuer de vraies recherches qui sont à la base d'un bon apprentissage ...</p>"
        },

        {
            "id": 18,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Doublon",
            "message": "<p>Bonjour</p><p>Ce sujet est un doublon ...</p><p>Je vous invite à continuer la discussion sur l'autre sujet : ......</p>"
        },
        
        {
            "id": 19,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Mauvais titre",
            "message": "<center><h1>Mauvais titre</h1></center><p>Le titre est un élément important qui ne doit pas être négligé. N'oubliez pas cette règle simple : <strong>le titre idéal résume la question que vous allez poser en une petite phrase. Il doit permettre aux visiteurs de se repérer facilement dans le forum visité et d'identifier le sujet à sa seule lecture.</strong></p><p>Vous pouvez utiliser divers préfixes comme [Erreur], [MySQL], [Compatibilité], etc... Aussi, pensez à consulter les règles propres à chaque forum (visibles dans les topics épinglés en haut des sections).</p><p>De plus, choisir un bon titre permet de rendre plus faciles les recherches des autres membres.</p><p>Les titres de type \"besoin d'aide\" ou \"problème\" ne sont pas tolérés.</p>"
        },
        
        {
            "id": 20,
            "section": ["all"],
            "exclude": ["Forum du staff"],
            "title": "Pas d'urgence",
            "message": "<center><h1>Aucune urgence</h1></center><p>Vous êtes sur un forum d'entraide, pas sur un site de service. Ici les intervenants vous répondent quand ils le veulent, s'ils le veulent, sans aucune obligation. Aussi, ce genre d'indications rendent le forum moins agréable à utiliser et moins équitable. De ce fait, les mentions de quelconque \"urgence\" ne sont pas admises sur ce forum. La meilleure façon d'avoir de l'aide rapidement ici est de fournir toutes les informations nécessaires et de les présenter correctement. N'hésitez pas à lire les règles épinglés en haut des serctions du forum, elles indiquent généralement ce qui est nécessaire.</p>"
        }
    ]
}
